#Область СлужебныеПроцедурыИФункции
&НаСервере
&После("СоздатьДочернееДело")
Процедура ГСД_СоздатьДочернееДело(Дело)
	ЭлементДелоВладелец = Элементы.Найти(Дело.ИдентификаторВладельца);
	Если ЭлементДелоВладелец = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	Если Найти(ЭлементДелоВладелец.Имя,"СотрудникиДниРождений")>0 Тогда  
		ЭлементДелоВладелец.РасширеннаяПодсказка.РастягиватьПоГоризонтали = Ложь;
		ЭлементДелоВладелец.РасширеннаяПодсказка.Шрифт     = Новый Шрифт("Courier New", 8);
		//ЭлементДелоВладелец.РасширеннаяПодсказка.Шрифт     = Новый Шрифт("Lucida Console", 8);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти