#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГСД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ГруппаРеквизитов=ДоработкаФормыСервер.ДобавитьГруппуДляРеквизитовОтображаемую(ЭтотОбъект,Элементы.Главное,"Доработки");
	//реквизит для показа выделенных сумм Элементы.ГруппаЗапускИЗавершениеРаботы
	ДоработкаФормыСервер.ДобавитьСохраняемыйРеквизитИЭлементФормы(ЭтотОбъект, ГруппаРеквизитов, "ГСД_ВключитьПоказСуммыВыделенныхСтрок","Включить показ суммы выделенных строк");
	// реквизит для разрешения показа дней рождений
	ДоработкаФормыСервер.ДобавитьСохраняемыйРеквизитИЭлементФормы(ЭтотОбъект, ГруппаРеквизитов, "ГСД_ДниРожденияВТекущихДелах","Показ дней рождения в текущих делах");
	// реквизит для разрешения показа входящих СЭДО
	ДоработкаФормыСервер.ДобавитьСохраняемыйРеквизитИЭлементФормы(ЭтотОбъект, ГруппаРеквизитов, "ГСД_ОтключитьСообщенияДляПользователяЭДО","Отключить сообщения для пользователя ЭДО");
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&После("ЗаписатьНастройкиНаСервере")
Процедура ГСД_ЗаписатьНастройкиНаСервере(ПараметрыКлиента)
		СохранитьСвойстваКоллекции("ОбщиеНастройкиПользователя", ЭтотОбъект,
		"ГСД_ВключитьПоказСуммыВыделенныхСтрок");
        // дни рождения
		СохранитьСвойстваКоллекции("ОбщиеНастройкиПользователя", ЭтотОбъект,
		"ГСД_ДниРожденияВТекущихДелах");
        // сообщения СЭДО
		СохранитьСвойстваКоллекции("ОбщиеНастройкиПользователя", ЭтотОбъект,
		"ГСД_ОтключитьСообщенияДляПользователяЭДО");		
КонецПроцедуры

#КонецОбласти

