#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГСД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)  
	ВключитьПоказСуммВыделенныхСтрок = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"ОбщиеНастройкиПользователя", 
	"ГСД_ВключитьПоказСуммыВыделенныхСтрок",
	Ложь);                                		
	
	Если ВключитьПоказСуммВыделенныхСтрок Тогда
		Расчет_Сервер.ДобавитьРеквизитыИЭлементыФормы(ЭтаФорма, Элементы.ГруппаИтоговПоДокументу);
		
		ИмяТаблицы="Начисления";
		ДополнитьКонтекстноеМеню(ИмяТаблицы,"ГСД_РассчитатьСуммуВыделенныхСтрокНачисления");
		
		ИмяТаблицы="НДФЛ";
		ДополнитьКонтекстноеМеню(ИмяТаблицы,"ГСД_РассчитатьСуммуВыделенныхСтрокНДФЛ");

		ИмяТаблицы="Удержания";
		ДополнитьКонтекстноеМеню(ИмяТаблицы,"ГСД_РассчитатьСуммуВыделенныхСтрокУдержания");

	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ГСД_СтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ГруппаНдфл Тогда
		ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокНДФЛ", 0.1, Истина);
	ИначеЕсли ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ГруппаНачисления Тогда	
		ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокНачисления", 0.1, Истина);
	ИначеЕсли ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ГруппаУдержания Тогда	
		ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокУдержания", 0.1, Истина);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисления

&НаКлиенте
Процедура ГСД_НачисленияПриАктивизацииСтрокиПосле(Элемент)
	ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокНачисления", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГСД_НачисленияПриИзмененииПосле(Элемент)
	ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокНачисления", 0.1, Истина);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНДФЛ

&НаКлиенте
Процедура ГСД_НДФЛПриАктивизацииСтрокиПосле(Элемент)
	ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокНДФЛ", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГСД_НДФЛПриИзмененииПосле(Элемент)
	ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокНДФЛ", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУдержания

&НаКлиенте
Процедура ГСД_УдержанияПриИзмененииПосле(Элемент)
	ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокУдержания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГСД_УдержанияПриАктивизацииСтрокиПосле(Элемент)
	ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокУдержания", 0.1, Истина);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ГСД_РассчитатьСуммуВыделенныхСтрокНачисления()   
	Если ВключитьПоказСуммВыделенныхСтрок Тогда	
		Расчет_Клиент.РассчитатьСуммуВыделенныхСтрок(ЭтаФорма,"Начисления","Результат"); 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ГСД_РассчитатьСуммуВыделенныхСтрокНДФЛ()
	Если ВключитьПоказСуммВыделенныхСтрок Тогда	
		Расчет_Клиент.РассчитатьСуммуВыделенныхСтрок(ЭтаФорма,"НДФЛ","Налог"); 
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ГСД_РассчитатьСуммуВыделенныхСтрокУдержания()
	Если ВключитьПоказСуммВыделенныхСтрок Тогда	
		Расчет_Клиент.РассчитатьСуммуВыделенныхСтрок(ЭтаФорма,"Удержания","Результат"); 		
	КонецЕсли;		

КонецПроцедуры

&НаСервере
Процедура ДополнитьКонтекстноеМеню(ИмяТаблицы,КомандаДействие)
		КонтекстноеМеню = Элементы[ИмяТаблицы].КонтекстноеМеню;
		ИмяКоманды = "ОбновитьСуммуВыделенныхСтрок"+ИмяТаблицы;
    	Команда = Команды.Добавить(ИмяКоманды);
    	Команда.Заголовок = "Ʃ обновить";
		
    	Команда.Действие  = КомандаДействие;
		
        ИмяЭлементаКоманды="КнопкаКоманды" + ИмяКоманды;
	    КнопкаКоманды = Элементы.Добавить(ИмяЭлементаКоманды, Тип("КнопкаФормы"),КонтекстноеМеню);
	    КнопкаКоманды.ИмяКоманды = ИмяКоманды;
		Элементы[ИмяЭлементаКоманды].СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.F5, Ложь, Ложь, Ложь);
КонецПроцедуры
	
#КонецОбласти
