#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГСД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//выполняем проверку необходимости показа сумм выделенных строк
	ВключитьПоказСуммВыделенныхСтрок = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"ОбщиеНастройкиПользователя", 
	"ГСД_ВключитьПоказСуммыВыделенныхСтрок",
	Ложь);                                		
	
	Если ВключитьПоказСуммВыделенныхСтрок Тогда              
		
		//определяем имя реквизита с результатом суммирования
		ИмяРеквизитаСРезультатомСуммирования="СуммаВыделенныхСтрок_Результат";
		ПрефиксПодсказки="Ндфл";  
		// добавляем группу для реквизитов
		ГруппаДобавленныхРеквизитов=ДоработкаФормыСервер.ДобавитьГруппуДляРеквизитов(ЭтотОбъект,Элементы.ГруппаИтоговПоДокументу);

		//добавляем реквизит с результатом суммирования на форму
		ДоработкаФормыСервер.ДобавитьРеквизитИЭлементФормы(ЭтотОбъект, ГруппаДобавленныхРеквизитов,ИмяРеквизитаСРезультатомСуммирования,ПрефиксПодсказки);
		
		//подключаем контекстное меню к табличным частям
		ИмяТаблицы="Начисления";
		ДоработкаФормыСервер.ДополнитьКонтекстноеМеню(ЭтотОбъект,ИмяТаблицы,"ГСД_РассчитатьСуммуВыделенныхСтрокНачисления");
		
		ИмяТаблицы="НДФЛ";
		ДоработкаФормыСервер.ДополнитьКонтекстноеМеню(ЭтотОбъект,ИмяТаблицы,"ГСД_РассчитатьСуммуВыделенныхСтрокНДФЛ");

		ИмяТаблицы="Удержания";
		ДоработкаФормыСервер.ДополнитьКонтекстноеМеню(ЭтотОбъект,ИмяТаблицы,"ГСД_РассчитатьСуммуВыделенныхСтрокУдержания");

	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ГСД_СтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ГруппаНдфл Тогда
		ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокНДФЛ", 0.1, Истина);
	ИначеЕсли ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ГруппаНачисления Тогда	
		ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокНачисления", 0.1, Истина);
	ИначеЕсли ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы.ГруппаУдержания Тогда	
		ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокУдержания", 0.1, Истина);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисления

&НаКлиенте
Процедура ГСД_НачисленияПриАктивизацииСтрокиПосле(Элемент)
	ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокНачисления", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГСД_НачисленияПриИзмененииПосле(Элемент)
	ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокНачисления", 0.1, Истина);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНДФЛ

&НаКлиенте
Процедура ГСД_НДФЛПриАктивизацииСтрокиПосле(Элемент)
	ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокНДФЛ", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГСД_НДФЛПриИзмененииПосле(Элемент)
	ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокНДФЛ", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУдержания

&НаКлиенте
Процедура ГСД_УдержанияПриИзмененииПосле(Элемент)
	ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокУдержания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГСД_УдержанияПриАктивизацииСтрокиПосле(Элемент)
	ПодключитьОбработчикОжидания("ГСД_РассчитатьСуммуВыделенныхСтрокУдержания", 0.1, Истина);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ГСД_РассчитатьСуммуВыделенныхСтрокНачисления()   
	Если ВключитьПоказСуммВыделенныхСтрок Тогда	
		ДоработкаФормыКлиент.РассчитатьСуммуВыделенныхСтрок(ЭтаФорма,"Начисления","Результат",ИмяРеквизитаСРезультатомСуммирования,ПрефиксПодсказки); 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ГСД_РассчитатьСуммуВыделенныхСтрокНДФЛ()
	Если ВключитьПоказСуммВыделенныхСтрок Тогда	
		ДоработкаФормыКлиент.РассчитатьСуммуВыделенныхСтрок(ЭтаФорма,"НДФЛ","Налог",ИмяРеквизитаСРезультатомСуммирования,ПрефиксПодсказки); 
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ГСД_РассчитатьСуммуВыделенныхСтрокУдержания()
	Если ВключитьПоказСуммВыделенныхСтрок Тогда	
		ДоработкаФормыКлиент.РассчитатьСуммуВыделенныхСтрок(ЭтаФорма,"Удержания","Результат",ИмяРеквизитаСРезультатомСуммирования,ПрефиксПодсказки); 		
	КонецЕсли;		

КонецПроцедуры
	
#КонецОбласти
