#Область ПрограммныйИнтерфейс

// Процедура - Добавить сохранямый в хранилище реквизит и элемент формы
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - форма, для которой добавляется реквизит.
//  РодительЭлемента - ГруппаФормы - группа формы, которой будет подчиняться добавляемый реквизит.
//  ИмяРеквизита - Строка - наименование добавляемого реквизита и связанного с ним элемента.
//
Процедура ДобавитьСохраняемыйРеквизитИЭлементФормы(Форма, РодительЭлемента, ИмяРеквизита, ЗаголовокЭлемента) Экспорт
	ДобавляемыеРеквизиты = Новый Массив; 
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита,Новый ОписаниеТипов("Булево")); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Форма[ИмяРеквизита] = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ОбщиеНастройкиПользователя", 
		ИмяРеквизита,
		Ложь);
	
	НовыйЭлемент = Форма.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"),РодительЭлемента);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = ИмяРеквизита;
	НовыйЭлемент.Заголовок = ЗаголовокЭлемента; 
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;

КонецПроцедуры


// Процедура - Добавить реквизит и элемент формы
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - форма, для которой добавляется реквизит.
//  РодительЭлемента - ГруппаФормы - группа формы, которой будет подчиняться добавляемый реквизит.
//  ИмяРеквизита - Строка - наименование добавляемого реквизита и связанного с ним элемента.
//
Процедура ДобавитьРеквизитИЭлементФормы(Форма, РодительЭлемента, ИмяРеквизита) Экспорт 
	//добавлем реквизит
	ДобавляемыеРеквизиты = Новый Массив; 
	РеквизитСумма = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)),, "Ʃ"); 
	ДобавляемыеРеквизиты.Добавить(РеквизитСумма);
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);   
	
	//добавлем связанный с реквизитом элемент
	ИмяЭлемента=ИмяРеквизита;                         	
	ЭлементСумма = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), РодительЭлемента);
	ЭлементСумма.Вид = ВидПоляФормы.ПолеВвода;      
	ЭлементСумма.ПутьКДанным = ИмяРеквизита;
	ЭлементСумма.ТолькоПросмотр = Истина;
	ЭлементСумма.Ширина = 12;
	ЭлементСумма.Подсказка = "Сумма выделенных строк F5-обновить";	
КонецПроцедуры	

// Процедура - Дополнить контекстное меню
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - форма, для которой добавляется контекстное меню
//  ИмяТаблицы		 - Строка - наименование таблицы подключения
//  КомандаДействие	 - Строка - имя процедуры выполняемой при нажатии на пункт меню
//
Процедура ДополнитьКонтекстноеМеню(Форма,ИмяТаблицы,КомандаДействие) Экспорт
		КонтекстноеМеню = Форма.Элементы[ИмяТаблицы].КонтекстноеМеню;
		ИмяКоманды = "ОбновитьСуммуВыделенныхСтрок"+ИмяТаблицы;
    	Команда = Форма.Команды.Добавить(ИмяКоманды);
    	Команда.Заголовок = "Ʃ обновить";
		
    	Команда.Действие  = КомандаДействие;
		
        ИмяЭлементаКоманды="КнопкаКоманды" + ИмяКоманды;
	    КнопкаКоманды = Форма.Элементы.Добавить(ИмяЭлементаКоманды, Тип("КнопкаФормы"),КонтекстноеМеню);
	    КнопкаКоманды.ИмяКоманды = ИмяКоманды;
		Форма.Элементы[ИмяЭлементаКоманды].СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.F5, Ложь, Ложь, Ложь);
КонецПроцедуры

#КонецОбласти

