#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГСД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавляемыеРеквизиты = Новый Массив; 
	НовыйРеквизит = Новый РеквизитФормы("ГСД_ВключитьПоказСуммыВыделенныхСтрок",Новый ОписаниеТипов("Булево")); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЭтаФорма.ГСД_ВключитьПоказСуммыВыделенныхСтрок = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ОбщиеНастройкиПользователя", 
		"ГСД_ВключитьПоказСуммыВыделенныхСтрок",
		Ложь);
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ГСД_ВключитьПоказСуммыВыделенныхСтрок", Тип("ПолеФормы"),Элементы.ГруппаЗапускИЗавершениеРаботы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "ГСД_ВключитьПоказСуммыВыделенныхСтрок";
	НовыйЭлемент.Заголовок = "Включить показ суммы выделенных строк"; 
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&После("ЗаписатьНастройкиНаСервере")
Процедура ГСД_ЗаписатьНастройкиНаСервере(ПараметрыКлиента)
		СохранитьСвойстваКоллекции("ОбщиеНастройкиПользователя", ЭтотОбъект,
		"ГСД_ВключитьПоказСуммыВыделенныхСтрок");

КонецПроцедуры

#КонецОбласти

