Процедура РассчитатьСуммуВыделенныхСтрок(Форма,ИмяТаблицы,РеквизитСуммирования) Экспорт 
	РасчитаннаяСумма = 0;  
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Начисления=Форма.Элементы.Найти(ИмяТаблицы);  
		Если Начисления<>Неопределено Тогда
			ВыделенныеСтроки = Форма.Элементы[ИмяТаблицы].ВыделенныеСтроки;
			Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
				Стр = Форма.Объект[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);   
				Если Не Стр = Неопределено Тогда
					РасчитаннаяСумма = РасчитаннаяСумма + Стр[РеквизитСуммирования];		
				КонецЕсли;	
			КонецЦикла;	  
			Форма.Сумма_СуммаВыделенныхСтрок = РасчитаннаяСумма;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	