#Область ПрограммныйИнтерфейс

// Процедура - Добавить реквизиты и элементы формы
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - форма, для которой добавляется реквизит.
//  РодительЭлемента - ГруппаФормы - группа формы, которой будет подчиняться добавляемый реквизит.
//  ИмяРеквизита - Строка - наименование добавляемого реквизита и связанного с ним элемента.
Процедура ДобавитьРеквизитыИЭлементыФормы(Форма, РодительЭлемента, ИмяРеквизита) Экспорт 
	//добавлем реквизит
	ДобавляемыеРеквизиты = Новый Массив; 
	РеквизитСумма = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)),, "Ʃ"); 
	ДобавляемыеРеквизиты.Добавить(РеквизитСумма);
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);   
	
	//добавлем связанный с реквизитом элемент
	ИмяЭлемента=ИмяРеквизита;                         	
	ЭлементСумма = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), РодительЭлемента);
	ЭлементСумма.Вид = ВидПоляФормы.ПолеВвода;      
	ЭлементСумма.ПутьКДанным = ИмяРеквизита;
	ЭлементСумма.ТолькоПросмотр = Истина;
	ЭлементСумма.Ширина = 12;
	ЭлементСумма.Подсказка = "Сумма выделенных строк";	
КонецПроцедуры	

// Процедура - Дополнить контекстное меню
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - форма, для которой добавляется контекстное меню
//  ИмяТаблицы		 - Строка - наименование таблицы подключения
//  КомандаДействие	 - Строка - имя процедуры выполняемой при нажатии на пункт меню
//
Процедура ДополнитьКонтекстноеМеню(Форма,ИмяТаблицы,КомандаДействие) Экспорт
		КонтекстноеМеню = Форма.Элементы[ИмяТаблицы].КонтекстноеМеню;
		ИмяКоманды = "ОбновитьСуммуВыделенныхСтрок"+ИмяТаблицы;
    	Команда = Форма.Команды.Добавить(ИмяКоманды);
    	Команда.Заголовок = "Ʃ обновить";
		
    	Команда.Действие  = КомандаДействие;
		
        ИмяЭлементаКоманды="КнопкаКоманды" + ИмяКоманды;
	    КнопкаКоманды = Форма.Элементы.Добавить(ИмяЭлементаКоманды, Тип("КнопкаФормы"),КонтекстноеМеню);
	    КнопкаКоманды.ИмяКоманды = ИмяКоманды;
		Форма.Элементы[ИмяЭлементаКоманды].СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.F5, Ложь, Ложь, Ложь);
КонецПроцедуры

#КонецОбласти

