Процедура ДобавитьРеквизитыИЭлементыФормы(Форма, РодительЭлемента) Экспорт 
	ДобавляемыеРеквизиты = Новый Массив; 
	РеквизитСумма = Новый РеквизитФормы("Сумма_СуммаВыделенныхСтрок", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)),, "Ʃ"); 
	ДобавляемыеРеквизиты.Добавить(РеквизитСумма);
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);   
	
	ЭлементСумма = Форма.Элементы.Добавить("Сумма_СуммаВыделенныхСтрок", Тип("ПолеФормы"), РодительЭлемента);
	ЭлементСумма.Вид = ВидПоляФормы.ПолеВвода;      
	ЭлементСумма.ПутьКДанным = "Сумма_СуммаВыделенныхСтрок";
	ЭлементСумма.ТолькоПросмотр = Истина;
	ЭлементСумма.Ширина = 12;
	ЭлементСумма.Подсказка = "Сумма выделенных строк табличной части документа";	
КонецПроцедуры	