// Процедура - Рассчитать сумму выделенных строк
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - форма, для которой производится расчет.
//  ИмяТаблицы		 - Строка - наименование таблицы расчета сумм выделенных строк.
//  РеквизитСуммирования - Строка - нименование реквизита по которому происходит суммирование.
//  РеквизитРезультатаСуммирования - - Строка - нименование реквизита результата.
//
Процедура РассчитатьСуммуВыделенныхСтрок(Форма,ИмяТаблицы,РеквизитСуммирования,РеквизитРезультатаСуммирования,ПрефиксПодсказки) Экспорт 
	РасчитаннаяСумма = 0;  
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Начисления=Форма.Элементы.Найти(ИмяТаблицы);  
		Если Начисления<>Неопределено Тогда
			ВыделенныеСтроки = Форма.Элементы[ИмяТаблицы].ВыделенныеСтроки;
			Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
				СтрокаТаблицы = Форма.Объект[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);   
				Если Не СтрокаТаблицы = Неопределено Тогда
					РасчитаннаяСумма = РасчитаннаяСумма + СтрокаТаблицы[РеквизитСуммирования];		
				КонецЕсли;	
			КонецЦикла;	  
			Форма[РеквизитРезультатаСуммирования] = РасчитаннаяСумма; 
			//+ГС 05.12.2024  
			Если ЗначениеЗаполнено(ПрефиксПодсказки) Тогда
				Если ИмяТаблицы="Начисления" Тогда
					Подсказка=Формат(РасчитаннаяСумма*13/100,"ЧЦ=10; ЧДЦ=2");
				Иначе	
					Подсказка=Формат(0,"ЧЦ=10; ЧДЦ=2");
				КонецЕсли;	                                          
				Форма[РеквизитРезультатаСуммирования+ПрефиксПодсказки]=Подсказка;
			КонецЕсли;
			//-ГС 05.12.2024
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	

// Процедура - Рассчитать сумму выделенных строк
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - форма, для которой производится расчет.
//  ИмяТаблицы		 - Строка - наименование таблицы расчета сумм выделенных строк.
//  РеквизитСуммирования - Строка - нименование реквизита по которому происходит суммирование.
//  РеквизитРезультатаСуммирования - - Строка - нименование реквизита результата.
//
Процедура РассчитатьСуммуВыделенныхСтрокДляПремии(Форма,ИмяТаблицы,РеквизитСуммирования,РеквизитРезультатаСуммирования, ПрефиксПодсказки, ПрефиксПодсказкиДоп=Неопределено) Экспорт 
	РасчитаннаяСумма = 0;                   
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Начисления=Форма.Элементы.Найти(ИмяТаблицы);  
		Если Начисления<>Неопределено Тогда
			ВыделенныеСтроки = Форма.Элементы[ИмяТаблицы].ВыделенныеСтроки;
			Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
				СтрокаТаблицы = Форма.Объект[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);   
				Если Не СтрокаТаблицы = Неопределено Тогда
					РасчитаннаяСумма = РасчитаннаяСумма + СтрокаТаблицы[РеквизитСуммирования];//+СтрокаТаблицы["РезультатЗависимыхНачислений1"];//рк в документе	
				КонецЕсли;	
			КонецЦикла;	  
			Форма[РеквизитРезультатаСуммирования] = РасчитаннаяСумма; 
			//+ГС 09.12.2024                              
			//выводим районный коэф
			Если ЗначениеЗаполнено(ПрефиксПодсказки) Тогда
				Если ИмяТаблицы="Начисления" Тогда
					Подсказка=Формат(РасчитаннаяСумма*30/100,"ЧЦ=10; ЧДЦ=2");
				Иначе	
					Подсказка=Формат(0,"ЧЦ=10; ЧДЦ=2");
				КонецЕсли;	                                          
				Форма[РеквизитРезультатаСуммирования+ПрефиксПодсказки]=Подсказка;
			КонецЕсли;
			//-ГС 09.12.2024			
			//+ГС 05.12.2024                              
			//выводим ндфл
			Если ЗначениеЗаполнено(ПрефиксПодсказкиДоп) Тогда
				Если ИмяТаблицы="Начисления" Тогда
					Подсказка=Формат(1.3*РасчитаннаяСумма*13/100,"ЧЦ=10; ЧДЦ=2");
				Иначе	
					Подсказка=Формат(0,"ЧЦ=10; ЧДЦ=2");
				КонецЕсли;	                                          
				Форма[РеквизитРезультатаСуммирования+ПрефиксПодсказкиДоп]=Подсказка;
			КонецЕсли;
			//-ГС 05.12.2024
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	