#Область ПрограммныйИнтерфейс

// ГСИ получить информацию о входящих сообщениях для пользователя ЭДО.
&Вместо("ПолучитьИнформациюОВходящихСообщенияхДляПользователяЭДО")
Процедура ГСД_ПолучитьИнформациюОВходящихСообщенияхДляПользователяЭДО()
	// удалить настройку со старым ключом настроек
	ГСИ_ОтключитьСообщенияДляПользователяЭДО = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"ОбщиеНастройкиПользователя", 
		"ГСИ_ОтключитьСообщенияДляПользователяЭДО",
		Ложь);
	Если ГСИ_ОтключитьСообщенияДляПользователяЭДО Тогда	
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекУдалить("ОбщиеНастройкиПользователя", "ГСИ_ОтключитьСообщенияДляПользователяЭДО", ИмяПользователя());
	КонецЕсли;	                                       
	//подключаем с новым ключои
	ГСД_ОтключитьСообщенияДляПользователяЭДО = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"ОбщиеНастройкиПользователя", 
		"ГСД_ОтключитьСообщенияДляПользователяЭДО",
		Ложь);
	Если ГСД_ОтключитьСообщенияДляПользователяЭДО Тогда
		Возврат;
	КонецЕсли;	
		
	ПродолжитьВызов();
	
КонецПроцедуры

#КонецОбласти