#Область ПрограммныйИнтерфейс
Функция ДобавитьГруппуДляРеквизитов(Форма,РодительЭлемента) Экспорт
	
	ГруппаРеквизитов=Форма.Элементы.Добавить("ГруппаПараметров",Тип("ГруппаФормы"),РодительЭлемента);
	ГруппаРеквизитов.Вид= ВидГруппыФормы.ОбычнаяГруппа;     
	ГруппаРеквизитов.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаРеквизитов.ОтображатьЗаголовок = Ложь; 	
	ГруппаРеквизитов.Группировка= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
    Возврат ГруппаРеквизитов;
	
КонецФункции

// Добавить группу для реквизитов отображаемую.
// 
// Параметры:
//  Форма -ФормаКлиентскогоПриложения - форма для которой добавляется группа
//  РодительЭлемента -ГруппаФормы -Родитель элемента
//  Заголовок -Строка-Заголовок для группы
// 
// Возвращаемое значение: 
// ГруппаФормы - добавленная группа
//  
Функция ДобавитьГруппуДляРеквизитовОтображаемую(Форма,РодительЭлемента,Заголовок) Экспорт
	
	ГруппаРеквизитов=Форма.Элементы.Добавить("ГруппаПараметров",Тип("ГруппаФормы"),РодительЭлемента);
	ГруппаРеквизитов.Вид= ВидГруппыФормы.ОбычнаяГруппа;     
	ГруппаРеквизитов.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаРеквизитов.ОтображатьЗаголовок = Истина; 	
	ГруппаРеквизитов.Заголовок=Заголовок;
	ГруппаРеквизитов.Группировка= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
    Возврат ГруппаРеквизитов;
	
КонецФункции

// Процедура - Добавить сохранямый в хранилище реквизит и элемент формы
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - форма, для которой добавляется реквизит.
//  РодительЭлемента - ГруппаФормы - группа формы, которой будет подчиняться добавляемый реквизит.
//  ИмяРеквизита - Строка - наименование добавляемого реквизита и связанного с ним элемента.
//
Процедура ДобавитьСохраняемыйРеквизитИЭлементФормы(Форма, РодительЭлемента, ИмяРеквизита, ЗаголовокЭлемента) Экспорт
	ДобавляемыеРеквизиты = Новый Массив; 
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита,Новый ОписаниеТипов("Булево")); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Форма[ИмяРеквизита] = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ОбщиеНастройкиПользователя", 
		ИмяРеквизита,
		Ложь);
	
	НовыйЭлемент = Форма.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"),РодительЭлемента);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = ИмяРеквизита;
	НовыйЭлемент.Заголовок = ЗаголовокЭлемента; 
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;

КонецПроцедуры


// Процедура - Добавить реквизит и элемент формы
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - форма, для которой добавляется реквизит.
//  РодительЭлемента - ГруппаФормы - группа формы, которой будет подчиняться добавляемый реквизит.
//  ИмяРеквизита - Строка - наименование добавляемого реквизита и связанного с ним элемента.
//
Процедура ДобавитьРеквизитИЭлементФормы(Форма, ГруппаРеквизитов, ИмяРеквизита,ПрефиксПодсказки,ПрефиксПодсказкиДоп=Неопределено) Экспорт 
	
	//добавлем реквизит
	ДобавляемыеРеквизиты = Новый Массив; 
	РеквизитСумма = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)),, "Ʃ"); 
	ДобавляемыеРеквизиты.Добавить(РеквизитСумма);
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);   
	
	//добавлем связанный с реквизитом элемент
	ИмяЭлемента=ИмяРеквизита;                         	
	ЭлементСумма = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаРеквизитов);
	ЭлементСумма.Вид = ВидПоляФормы.ПолеВвода;      
	ЭлементСумма.ПутьКДанным = ИмяРеквизита;
	ЭлементСумма.ТолькоПросмотр = Истина;
	ЭлементСумма.Ширина = 12;
	ЭлементСумма.Подсказка = "F5-обновить";
	//+ГС 05.12.2024 
	ЭлементСумма.ОтображениеПодсказки=ОтображениеПодсказки.Кнопка;
	Если ЗначениеЗаполнено(ПрефиксПодсказки) Тогда
		//добавлем реквизит
		ИмяРеквизитаПодсказка=ИмяРеквизита+ПрефиксПодсказки;
		ДобавляемыеРеквизиты = Новый Массив; 
		РеквизитСумма = Новый РеквизитФормы(ИмяРеквизитаПодсказка, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)),,ПрефиксПодсказки); 
		ДобавляемыеРеквизиты.Добавить(РеквизитСумма);
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);   
		//Добавляем элемент к реквизиту                     
		ИмяЭлемента=ИмяРеквизитаПодсказка;                         	
		ЭлементПодсказки = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаРеквизитов);	
		ЭлементПодсказки.Вид = ВидПоляФормы.ПолеНадписи;      
		ЭлементПодсказки.ПутьКДанным = ИмяРеквизитаПодсказка;
		ЭлементПодсказки.ТолькоПросмотр = Истина;
		ЭлементПодсказки.Ширина = 12; 
		//ЭлементПодсказки.ПоложениеЗаголовка =ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПрефиксПодсказкиДоп) Тогда
		//добавлем реквизит
		ИмяРеквизитаПодсказка=ИмяРеквизита+ПрефиксПодсказкиДоп;
		ДобавляемыеРеквизиты = Новый Массив; 
		РеквизитСумма = Новый РеквизитФормы(ИмяРеквизитаПодсказка, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)),,ПрефиксПодсказкиДоп); 
		ДобавляемыеРеквизиты.Добавить(РеквизитСумма);
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);   
		//Добавляем элемент к реквизиту                     
		ИмяЭлемента=ИмяРеквизитаПодсказка;                         	
		ЭлементПодсказки = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаРеквизитов);	
		ЭлементПодсказки.Вид = ВидПоляФормы.ПолеНадписи;      
		ЭлементПодсказки.ПутьКДанным = ИмяРеквизитаПодсказка;
		ЭлементПодсказки.ТолькоПросмотр = Истина;
		ЭлементПодсказки.Ширина = 12; 
		//ЭлементПодсказки.ПоложениеЗаголовка =ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;

	//-ГС 05.12.2024
	
КонецПроцедуры	

// Процедура - Дополнить контекстное меню
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - форма, для которой добавляется контекстное меню
//  ИмяТаблицы		 - Строка - наименование таблицы подключения
//  КомандаДействие	 - Строка - имя процедуры выполняемой при нажатии на пункт меню
//
Процедура ДополнитьКонтекстноеМеню(Форма,ИмяТаблицы,КомандаДействие) Экспорт
		КонтекстноеМеню = Форма.Элементы[ИмяТаблицы].КонтекстноеМеню;
		ИмяКоманды = "ОбновитьСуммуВыделенныхСтрок"+ИмяТаблицы;
    	Команда = Форма.Команды.Добавить(ИмяКоманды);
    	Команда.Заголовок = "Ʃ обновить";
		
    	Команда.Действие  = КомандаДействие;
		
        ИмяЭлементаКоманды="КнопкаКоманды" + ИмяКоманды;
	    КнопкаКоманды = Форма.Элементы.Добавить(ИмяЭлементаКоманды, Тип("КнопкаФормы"),КонтекстноеМеню);
	    КнопкаКоманды.ИмяКоманды = ИмяКоманды;
		Форма.Элементы[ИмяЭлементаКоманды].СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.F5, Ложь, Ложь, Ложь);
КонецПроцедуры

Процедура ДобавитьКнопку(Форма,ГруппаРеквизитов,КомандаДействие) Экспорт
	//Создаем Команду
	НоваяКоманда = Форма.Команды.Добавить("КомандаПодсказок");
	НоваяКоманда.Действие = КомандаДействие;	//имя процедуры-обработчика
	НоваяКоманда.Заголовок = "Расх по ндфл";
	//добавляем кнопку команды
	НоваяКнопка = Форма.Элементы.Добавить("КнопкаПодсказок", Тип("КнопкаФормы"),ГруппаРеквизитов);
	НоваяКнопка.ИмяКоманды = "КомандаПодсказок";	
	НоваяКнопка.Вид = ВидКнопкиФормы.Гиперссылка;
КонецПроцедуры

&НаСервере
Процедура ВывестиТаблицуЗначенийВТабличныйДокумент(ТабДок,Тз) Экспорт

	ПостроительОтчета=Новый ПостроительОтчета;
	ИсточникДанных=Новый ОписаниеИсточникаДанных(ТЗ);
			
	ПостроительОтчета.ИсточникДанных=ИсточникДанных;
	ПостроительОтчета.Вывести(ТабДок);			
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти