// Процедура - Рассчитать сумму выделенных строк
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - форма, для которой производится расчет.
//  ИмяТаблицы		 - Строка - наименование таблицы расчета сумм выделенных строк.
//  РеквизитСуммирования - Строка - нименование реквизита по которому происходит суммирование.
//  РеквизитРезультатаСуммирования - - Строка - нименование реквизита результата.
//
Процедура РассчитатьСуммуВыделенныхСтрок(Форма,ИмяТаблицы,РеквизитСуммирования,РеквизитРезультатаСуммирования) Экспорт 
	РасчитаннаяСумма = 0;  
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Начисления=Форма.Элементы.Найти(ИмяТаблицы);  
		Если Начисления<>Неопределено Тогда
			ВыделенныеСтроки = Форма.Элементы[ИмяТаблицы].ВыделенныеСтроки;
			Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
				СтрокаТаблицы = Форма.Объект[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);   
				Если Не СтрокаТаблицы = Неопределено Тогда
					РасчитаннаяСумма = РасчитаннаяСумма + СтрокаТаблицы[РеквизитСуммирования];		
				КонецЕсли;	
			КонецЦикла;	  
			Форма[РеквизитРезультатаСуммирования] = РасчитаннаяСумма;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры	